/**
 * 67. 二进制求和
 * 给你两个二进制字符串，返回它们的和（用二进制表示）。
    输入为 非空 字符串且只包含数字 1 和 0。
    输入: a = "11", b = "1"
    输出: "100"
 * @param {string} a
 * @param {string} b
 * @return {string}
 * BigInt + toString(2)教你做人
 * 72 ms 74.57%
 * 41.3 MB 37.84%
 */
var addBinary = function(a, b) {
    return (BigInt(`0b${a}`) + BigInt(`0b${b}`)).toString(2)
};

let a = "10100000100100110110010000010101111011011001101110111111111101000000101111001110001111100001101", b = "110101001011101110001111100110001010100001101011101010000011011011001011101111001100000011011110011"



console.log(addBinary(a, b));